Table of Contents
 Class CheckMember1D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Check meber 1D
[OpenModelClass("CI.Services.Common.CheckMember1D,CI.ServicesCommon", "CI.StructModel.Structure.ICheckMember, CI.BasicTypes", typeof(CheckMember))]
public class CheckMember1D : CheckMember
Inheritance
object
OpenObject
OpenElementId
CheckMember
CheckMember1D
Inherited Members
 CheckMember.Name
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CheckMember1D()
Constructor
public CheckMember1D()
 Edit this page